Autodesk.Revit.DB.BuildingSiteExportOptions.#ctor
Default constructor. Sets all options to their default values.

Autodesk.Revit.DB.BuildingSiteExportOptions.TotalOccupancy
Custom value for the total occupancy.
Remarks: If specified value > 0, the value will be used
instead of the default value calculated internally.

Autodesk.Revit.DB.BuildingSiteExportOptions.TotalGrossArea
Custom value for the total area.
Remarks: If specified value > 0.0, the value will be used
instead of the default value calculated internally.

Autodesk.Revit.DB.BuildingSiteExportOptions.AreaPerPerson
Custom value for Area Per Person value.
Remarks: If specified value > 0.0, the value will be used
instead of the default value calculated internally.

Autodesk.Revit.DB.BuildingSiteExportOptions.PropertyLineOffset
Property Line Offset. Default is 0.0.
Remarks: Is only used if property line is also specified.

Autodesk.Revit.DB.BuildingSiteExportOptions.PropertyLine
Optional property Line to export; it may be null.

Autodesk.Revit.DB.BuildingSiteExportOptions
Building Site Export options.